/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

功能：求1000以内的素数。

注意：除要求填空的位置外，请勿改动程序中其他内容。

-------------------------------------------------------*/
#include<stdio.h>
#include<math.h>
int main( )
{  int k=0,i,sqrtm,m;
   for( m=2; m<=1000; m++)
   {  sqrtm=(int)sqrt(m);
/***********SPACE***********/
      for(i=2;【?】sqrtm;i++) 
/***********SPACE***********/
        if(【?】) 
          break;
/***********SPACE***********/
      if(【?】) 
      {
        if(k++%10==0)  printf("\n");
        printf("%5d",m);
      }
   }
   return 0;
}
