/*------------------------------------------------------        
【程序改错】
--------------------------------------------------------

功能：有一数组内放10个整数,要求找出最小数和它的下标,然后
      把它和数组中最前面的元素即第一个数对换位置.

------------------------------------------------------*/
#include <stdio.h>
main( )
{  
  int  i,a[10],min,k=0;
  printf("\n please input array 10 elements\n");
  for(i=0;i<10;i++) 
    /***********FOUND***********/
    scanf("%d", a[i]);
  for(i=0;i<10;i++)
    printf("%d",a[i]); 
  min=a[0];
  /***********FOUND***********/
  for(i=3;i<10;i++)   
    /***********FOUND***********/
    if(a[i]>min)
    {
      min=a[i];
      k=i;
    }
  /***********FOUND***********/
  a[k]=a[i];
  a[0]=min;
  printf("\n after eschange:\n");
  for(i=0;i<10;i++) 
    printf("%d",a[i]);
  printf("\nk=%d\nmin=%d\n",k,min);
}
