/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：打印输出一个N阶方阵：右下三角元素之和（包括副
      对角线上的元素）。
      例如下列方阵， 其右下三角元素之和为110。  
           1   2   3   4
           5   6   7   8
           9  10  11  12
          13  14  15  16
      
------------------------------------------------*/

#include <stdio.h>
#define N 4

void main()
{
  int a[N][N]={1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16},sum;
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
 {
   FILE *OUT;
   OUT=fopen("out.dat","w");
   if(OUT==NULL)
   {
     printf("Write FILE Error");
   }
    fprintf(OUT,"%d\n",sum);
    fclose(OUT);
 }
}
