/*------------------------------------------------------        
【程序改错】
--------------------------------------------------------

功能：数列中，第一项值为3，后一项都比前一项的值增5；下列给定程序计算前
      n(4<n<50)项的累加和：在累加过程中把那些被4除后余2的当前累加值放入
      数组中，输出符合此条件的累加值。例如，当n的值为20时，该数列为
      3，8，l3，18，23，28，…，93，98。符合此条件的累加值应为
      42，126，366，570，1010。
      请改正程序中的错误，使它能得出正确的结果。
      注意：不得增行或删行，也不得更改程序的结构。

------------------------------------------------------*/
#include <stdio.h>
#define  N  50
int main()
{
        int a[N],d=0,n,i, k,sum;
        printf("\nEnter n (4<n<=50); ");
        scanf("%d",&n);
        sum=0;
        for(k=3,i=0;i<n;i++,k+=5)
        { 
sum=sum+k;
/***********FOUND***********/
           if(sum%4==2)    
              a[d++]=sum;
        }
        printf("\n\nThe result :\n");
/***********FOUND***********/
        for(i=0; i<n/4; i++)printf("%6d",a[i]); 
        printf("\n\n");
}

