/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

将一个数组中的元素按逆序存放。
注意：除要求填空的位置之外，请勿改动程序中其他内容。
-------------------------------------------------------*/
#include <stdio.h>
#define N 7
int main ()
{
  int a[N]={12,9,16,5,7,2,1},k,s;
  printf("\n the origanal array:\n");
  for (k=0;k<N;k++)
    printf("%4d",a[k]);
  /***********SPACE***********/
  for (k=0;【?】;k++  )
  {
     s=a[k];
  /***********SPACE***********/
  【?】 ;
  /***********SPACE***********/
  【?】 ;
   }
   printf("\n the changed array:\n");
   for (k=0;k<N;k++)
       printf ("%4d",a[k]);
   return 0;
}

