/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

功能：下列给定程序的功能是：在字符串中的每个数字字符之后插入一个*号。
      例如，字符串为"def35adh3kjsdf7"，执行后结果为"def3*5*adh3*kjsdf7*"

-------------------------------------------------------*/
#include <stdio.h>
int main()
{  char  s[80]="def35adh3kjsdf7",i,j,n;
   printf("\nThe original string is :  %s\n",s);
        for(i=0; s[i]!='\0'; i++)
/***********SPACE***********/
     if(s[i]>='0'&&s[i]<='9')
     {  n=0;
/***********SPACE***********/
        while(s[i+1+n]!='\0')  n++;
        for(j=i+n+1; j>i; j--)
/***********SPACE***********/
           s[j+1]=s[j];
        s[j+1]='*';
        i=i+1;
     }
     printf("\nThe result is :  %s\n",s);
         return 0;
}
