/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

下列给定程序的功能是：有N×N矩阵，根据给定的m(m<＝N)值，
将每行元素中的值均向右移动m个位置，左位置为0。
例如，N＝4，m＝2，有下列矩阵
      11　　12　　13   14
      15　　16    17　 18　　
      19    20    21   22
      23    24    25   26
      程序执行结果为
      0　　0　　11   12      
      0　　0　　15   16
      0　　0　　19   20
      0    0    23   24
注意：除要求填空的位置之外，请勿改动程序中其他内容。
-------------------------------------------------------*/
#include<stdio.h>
#define  N  4
int main()
{  int t[][N]={11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26}, i, j, m;
   printf("\nThe original array:\n");
   for(i=0; i<N; i++)
   {  for(j=0; j<N; j++)
        printf("%d  ",t[i][j]);
      printf("\n");
   }
   printf("Input m (m<=%d): ",N);
   scanf("%d",&m);
   for(i=0; i<N;i++)
 /***********SPACE***********/
   {  for(【?】; j>=0; j--)
/***********SPACE***********/
         t[i][【?】]=t[i][j];
/***********SPACE***********/
      for(j=0;【?】; j++)
         t[i][j]=0;
  }
   printf("\nThe result is:\n");
   for(i=0; i<N; i++)
   {  for(j=0; j<N; j++)
        printf("%d  ",t[i][j]);
      printf("\n");
   }
   return 0;
}
