/*------------------------------------------------------        
【程序改错】
--------------------------------------------------------

下列给定程序中，先从键盘上输入一个3行3列矩阵的各个元素的值，
然后输出副对角线元素之和。
请改正程序中的错误，使它能得出正确的结果。
      
注意：不得增行或删行，也不得更改的程序的结构。

------------------------------------------------------*/
#include <stdio.h>
#define N 3
int main( )
{  
int a[N][N];
/***********FOUND***********/
int sum=0;
    int i,j;
for (i=0;i<N;i++)
      for (j=0;j<N;j++)
/***********FOUND***********/
scanf("%d", &a[i][j]);
    for (i=0;i<N;i++)
/***********FOUND***********/
      sum=sum+a[i][N-1-i];
printf("sum=%d\n",sum);
return 0;
}

