/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

给定程序的功能是：将4*3矩阵中第k行的元素与第0行元素交换。
      例如，有下列矩阵：
        1        2        3
        4        5        6
        7        8        9
        10       11       12
      若k为2，程序执行结果为：
        7        8        9
        4        5        6
        1        2        3
        10       11       12

注意：除要求填空的位置之外，请勿改动程序中其他内容。
-------------------------------------------------------*/
#include  <stdio.h>
#define   N   3
#define   M   4
int main()
{ int a[M][N]={ {1,2,3},{4,5,6},{7,8,9},{10,11,12} },i,j,k=2,temp;
  printf("The array before moving:\n\n");
  for(i=0; i<M; i++)
  {  for(j=0; j<N; j++) printf("%3d",a[i][j]);
     printf("\n\n");
  }

  for(i = 0 ; i<N; i++)
/***********SPACE***********/
  {temp=a[0][i] ;
/***********SPACE***********/
    a[0][i] =a[k][i];
    a[k][i] = temp ;
  }
  printf("The array after moving:\n\n");
  for(i=0; i<M; i++)
  {  for(j=0; j<N; j++) printf("%3d",a[i][j]);
     printf("\n\n");
  }
  return 0;
}
