/*------------------------------------------------------        
【程序改错】
--------------------------------------------------------

功能：下列程序功能是：根据m的值（2≤m≤9），在m行m列的二维数组中
      存放如下所示的数据并输出。
      例如，若输入2         若输入4
            则输出：        则输出：
            1  2            1   2   3   4
            2  4            2   4   6   8
                            3   6   9   12
                            4   8   12  16
      请改正程序中的错误，使它能得出正确的结果。
      注意：不得增行或删行，也不得更改程序的结构。

------------------------------------------------------*/
#include <stdio.h>
#define M 10
int a[M][M] = {0};
int main()
{
      int i, j, m;
      printf(" Enter m:");
      /***********FOUND***********/
      scanf("%d", &m);
      for (i = 0; i < m; i++)
            for (j = 0; j < m; j++)
                  /***********FOUND***********/
                  a[i][j] = (i+1)*(j+1);
      for (i = 0; i < m; i++)
      {
            for (j = 0; j < m; j++)
                  printf("%4d", a[i][j]);
            printf("\n");
      }
      return 0;
}
