/*------------------------------------------------------    
【程序改错】
--------------------------------------------------------
打印出杨辉三角形（要求打印出10行）。
下面给定的程序存在错误，请改正。

注意：不得增行或删行，也不得更改程序的结构。
------------------------------------------------------*/

#include<stdio.h>
int main()
{
  int i,j;
  int a[10][10];
  printf("\n");
  /**********FOUND**********/
  for(i=0;i<10;i++)
  {
    a[i][0]=1;
    a[i][i]=1;
  }
  /**********FOUND**********/
  for(i=2;i<10;i++)
    for(j=1;j<i;j++)
      /**********FOUND**********/
      a[i][j]=a[i-1][j-1]+a[i-1][j];
  for(i=0;i<10;i++)
  {
    for(j=0;j<=i;j++)
      printf("%5d",a[i][j]);
    printf("\n");
  }  
}
